# Pandas

#### DataFrames is a combination of columns and rows just like CSV

In [2]:
import numpy as np
import pandas as pd

In [3]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=['Column1','Column2','Column3','Column4'])

In [7]:
type(df)

pandas.core.frame.DataFrame

In [4]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [5]:
df.to_csv('Test.csv')

In [6]:
#Accsessing the elements
# 1. .loc 2. .iloc
df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [32]:
df['Column3']

Row1     2
Row2     6
Row3    10
Row4    14
Row5    18
Name: Column3, dtype: int32

In [34]:
df[['Column2','Column4']]

      Column2  Column4
Row1        1        3
Row2        5        7
Row3        9       11
Row4       13       15
Row5       17       19

In [17]:
type(df.loc['Row1'])

pandas.core.series.Series

In [12]:
df.iloc[:,:]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

### ****Dataset has more than one column and more than one row

In [8]:
df.iloc[0:2,0:2]

      Column1  Column2
Row1        0        1
Row2        4        5

In [9]:
type(df.iloc[0:2,0:2])

pandas.core.frame.DataFrame

In [11]:
#Convert Dataframes into array
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [25]:
df.iloc[:,1:].values.shape

(5, 3)

In [14]:
df.isnull().sum() # Important

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [28]:
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [30]:
df['Column1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: Column1, dtype: int64

In [31]:
df['Column1'].unique()

array([ 0,  4,  8, 12, 16], dtype=int64)

In [40]:
df1=pd.read_csv('mercedesbenz.csv')

In [41]:
df1.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [42]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [44]:
df1.describe()

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [48]:
df1['X0'].value_counts() #Get the unique category counts

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
m      34
ai     34
e      32
ba     27
at     25
a      21
ax     19
i      18
am     18
aq     18
u      17
l      16
aw     16
ad     14
b      11
k      11
au     11
r      10
as     10
bc      6
ao      4
c       3
aa      2
q       2
g       1
ab      1
ac      1
Name: X0, dtype: int64

In [49]:
df1[df1['y']>100]

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
6,24,128.76,al,r,e,f,d,f,h,s,...,0,0,0,0,0,0,0,0,0,0
8,27,108.67,w,s,as,e,d,f,i,h,...,1,0,0,0,0,0,0,0,0,0
9,30,126.99,j,b,aq,c,d,f,a,e,...,0,0,1,0,0,0,0,0,0,0
10,31,102.09,h,r,r,f,d,f,h,p,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4202,8402,123.34,ap,l,s,c,d,aa,d,r,...,0,0,0,0,0,0,0,0,0,0
4204,8405,107.39,ak,s,as,c,d,aa,d,q,...,1,0,0,0,0,0,0,0,0,0
4205,8406,108.77,j,o,t,d,d,aa,h,h,...,0,1,0,0,0,0,0,0,0,0
4206,8412,109.22,ak,v,r,a,d,aa,g,e,...,0,0,1,0,0,0,0,0,0,0
4208,8417,110.85,z,r,ae,c,d,aa,g,w,...,1,0,0,0,0,0,0,0,0,0

# CSV (Conceptual)

In [64]:
data=('col1,col2,col3\n'
     'x,y,1\n'
     'a,b,2\n'
     'c,d,3\n')

In [53]:
from io import StringIO,BytesIO

In [54]:
type(data)

str

In [65]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [67]:
## Readd from specific column
df2=pd.read_csv(StringIO(data),usecols=['col1','col3'])

In [69]:
df2

  col1  col3
0    x     1
1    a     2
2    c     3

In [71]:
df2.to_csv('Test1.csv')

In [81]:
# Specifying Column Data Types
data2=('a,b,c,d\n'
       '1,2,3,4\n'
       '5,6,7,8\n'
       '9,10,11,12'
)

In [82]:
print(data2)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11,12

In [83]:
df4=pd.read_csv(StringIO(data2),dtype=int)

In [84]:
df4

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [85]:
df4['a'][1]

5

In [90]:
df4['a']

0    1
1    5
2    9
Name: a, dtype: Int64

In [91]:
df4=pd.read_csv(StringIO(data2),dtype={'b':int,'c':float,'a':'Int64'})

In [93]:
df4

   a   b     c   d
0  1   2   3.0   4
1  5   6   7.0   8
2  9  10  11.0  12

In [94]:
df4.dtypes

a      Int64
b      int32
c    float64
d      int64
dtype: object

In [98]:
# Index Columns
data5=('Index,a,b,c\n'
       '4,apple,bat,5.7\n'
       '8,orange,cow,10'
)

In [100]:
pd.read_csv(StringIO(data5),index_col=0)

            a    b     c
Index
4       apple  bat   5.7
8      orange  cow  10.0

In [101]:
data6=('a,b,c\n'
       '4,apple,bat\n'
       '8,orange,cow'
)

In [106]:
pd.read_csv(StringIO(data6),index_col=False)

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [107]:
## Combining usecols & index_col
data6=('Index,a,b,c\n'
       '4,apple,bat,5.7\n'
       '8,orange,cow,10')

In [108]:
pd.read_csv(StringIO(data6),usecols=['b','c'],index_col=False)

     b     c
0  bat   5.7
1  cow  10.0

In [110]:
## Quoting & Escaping Characters . Very Helpful in NLP
data7='a,b\n"hello,\\"Bob\\",nice to see you",5'

In [114]:
pd.read_csv(StringIO(data7),escapechar="\\")

                             a  b
0  hello,"Bob",nice to see you  5

In [3]:
## URL to CSV
df8=pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',sep='\t')

In [4]:
df8.head()

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,399
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,374
4,SA0L1,All items less food,1,T,358

In [5]:
type(df8)

pandas.core.frame.DataFrame